---
kind: property
id: P:Autodesk.Revit.DB.DWFExportOptions.ExportingAreas
source: html/a521a539-c5d5-4923-7d11-da21606022f4.htm
---
# Autodesk.Revit.DB.DWFExportOptions.ExportingAreas Property

Whether to also export areas and rooms' geometry.

## Syntax (C#)
```csharp
public bool ExportingAreas { get; set; }
```